---
kind: other
id: Methods.T:Autodesk.Revit.DB.IFailuresProcessor
source: html/309d224b-8434-8f58-a5b7-981aea235b25.htm
---
# IFailuresProcessor Methods

This method is being called in case of exception or document destruction to dismiss any possible pending failure UI that may
 have left on the screen